import { Dialog } from 'primereact/dialog';

export default function PrivacyPolicy(props) {
  let contentPolocy;

  if (props.title === 'Политика за Поверителност') {
    contentPolocy = (
      <div className="m-0 font-loto text-primary leading-8">
          <p>Благодарим ви,  че посетихте нашия уебсайт и обмислихте да запазите час при нас. Ние ценим вашата поверителност и се ангажираме да защитаваме личната информация, която ни предоставяте. Тази Политика за Поверителност описва как събираме, използваме, разкриваме и защитаваме вашата лична информация, когато използвате нашия уебсайт запазвайки часове за технически прегледна вашия автомобил.</p>
          <p className="mt-5"><strong>1. Информация относно Администратора на лични данни</strong></p>
          <p>За целите на законодателството в областта на защитата на данните, ние сме администратори при обработването на Вашите лични данни:</p>
          <p>- <strong>Наименование</strong> - „ВИТА 21“ ЕООД</p>
          <p>- <strong>ЕИК/БУЛСТАТ</strong> - ????</p>
          <p>- <strong>Седалище и адрес на управление</strong> - гр. Варна, ул. Атанас Москов 2А</p>
          <p>- <strong>E-mail</strong> - vita21.bg@gmail.com</p>
          <p className="mt-5"><strong>2. Цели на събирането на данни</strong></p>
          <p>Тази политика за поверителност се отнася до личните данни, които събираме от нашите клиенти, които използват нашето приложение за запазване на часове за годишен технически преглед.
          Ние събираме лични данни от нашите клиенти, за да можем да им предоставим услугите си:</p>
          <p>- <strong>регистрационен номер на колата</strong> - необходим за идентификация на автомобила и за извършване на техническия преглед</p> 
          <p>- <strong>име, фамилия</strong> - необходим за идентифициране на клиента</p> 
          <p>- <strong>телефон</strong> - необходим за връзка с клиента</p> 
          <p>- <strong>имейл</strong> - необходим за изпращане на информация за предстоящия технически преглед</p> 
          <p className="mt-5"><strong>3. Категории лични данни</strong></p>
          <p>Ние събираме следните категории лични данни от нашите клиенти:</p>
          <p>- <strong>лични данни за идентификация</strong> - име, фамилия, имейл</p> 
          <p>- <strong>данни за контакт</strong> - телефон</p> 
          <p>- <strong>данни за технически преглед</strong> - регистрационни данни на автомобила</p> 
          <p>Можем да използваме обобщени и анонимизирани данни, за да анализираме моделите на използване, да подобрим нашите услуги и да подобрим цялостното потребителско изживяване на нашия уебсайт. Тези данни не идентифицират отделни потребители.</p>
          <p className="mt-5"><strong>4. Вашите права при събирането, обработването и съхраняването на личните Ви данни?</strong></p>
          <p>- <strong>право на достъп</strong> - право да получат информация за личните си данни, които се съхраняват от нас</p> 
          <p>- <strong>право на коригиране</strong> - право да поискат коригиране на неточни или непълни лични данни</p> 
          <p>- <strong>право на изтриване</strong> - право да поискат изтриване на личните си данни, ако те вече не са необходими за целите, за които са били събрани</p> 
          <p>- <strong>право на ограничаване на обработката</strong> - право да поискат ограничаване на обработката на личните си данни</p> 
          <p>- <strong>право на преносимост на данните</strong> - право да получат личните си данни в структуриран, широко използван и машинно четим формат и да ги прехвърлят на друг администратор на данни</p> 
          <p>- <strong>право на възражение срещу обработката</strong> - право да възразят срещу обработката на личните си данни, която се основава на легитимен интерес</p> 
          <p className="mt-5"><strong>5. Разкриване на информация</strong></p>
          <p>Можем да разкрием вашата лична информация, ако това се изисква от закон, наредба или правен процес, или ако смятаме, че е необходимо, за да защитим нашите права, собственост или безопасност, или правата, собствеността или безопасността на други.</p>
          <p className="mt-5"><strong>6. Технически и организационни мерки за сигурност</strong></p>
          <p>Ние използваме разумни мерки за сигурност, за да защитим личната информация, която ни предоставяте, срещу неоторизиран достъп, разкриване, промяна или унищожаване. Въпреки това нито един метод за предаване през интернет или електронно съхранение не е 100% защитен и ние не можем да гарантираме абсолютна сигурност. Тези мерки включват:</p>
          <p>- <strong>опазване на достъпа до данните</strong> - достъпът до личните данни се ограничава до оторизирани лица</p>
          <p>- <strong>редовен мониторинг на сигурността</strong> - редовно наблюдаваме сигурността на нашата система за обработка на данни</p>
          <p>Нашият уебсайт не е насочен към лица под 18 години. Ние не събираме съзнателно лична информация от деца. Ако сте родител или настойник и смятате, че детето ви ни е предоставило лична информация без вашето съгласие, моля, свържете се с нас и ние ще предприемем стъпки да изтрием тази информация.</p>
          <p className="mt-5"><strong>7. Актуализация на Политика за поверителност</strong></p>
          <p>Може да актуализираме тази Политика за поверителност от време на време. Всички промени ще влязат в сила незабавно след публикуването на ревизираната Политика за Поверителност на нашия уебсайт. Препоръчваме ви периодично да преглеждате тази Политика за Поверителност, за да бъдете информирани за това как защитаваме и използваме вашата лична информация.</p>
          <p className="mt-5"><strong>8. Свържете се с нас</strong></p>
          <p> Ако имате някакви въпроси или притеснения относно тази Политика за Поверителност или нашите практики за поверителност, моля, свържете се с нас на Контакти</p>

      </div>
    )
  } else {
    contentPolocy = (
      <div className="m-0 font-loto text-primary leading-8">
        <p>Вита 21 ЕООД (наричано по-долу "Администратор" или "ние") предоставя услугите си на своите клиенти (наричани по-долу "Потребители" или "Вие") при спазване на настоящите Условия за ползване.</p>
        <p className="mt-5"><strong>1. Дефиниции</strong></p>
        <p>- "Услуги" означават всички услуги, предоставяни от Администратора на Потребителите, включително, но не само:</p>
        <p>запазване на часове за годишен технически преглед</p>
        <p>* изпращане на информация за предстоящия технически преглед</p>
        <p>* изпращане на информация за предстоящия технически преглед</p>
        <p>* други услуги, които могат да бъдат предоставяни от Администратора от време на време</p>
        <p>- "Уебсайт" означава уебсайта на Администратора, намиращ се на адрес гр. Варна, ул. Атанас Москов 2А.</p>
        {/* <p>"Приложение" означава приложението на Администратора, което може да бъде изтеглено от App Store или Google Play.</p> */}
        <p className="mt-5"><strong>2. Приемане на Условията за ползване</strong></p>
        <p>Чрез използването на Услугите, Потребителят декларира, че е запознат с настоящите Условия за ползване и ги приема безусловно</p>
        <p className="mt-5"><strong>3. Предмет на Условията за ползване</strong></p>
        <p>Настоящите Условия за ползване уреждат взаимоотношенията между Администратора и Потребителите, свързани с използването на Услугите.</p>
        <p className="mt-5"><strong>4. Предоставяне на Услугите</strong></p>
        <p>Администраторът предоставя Услугите на Потребителите безплатно.</p>
        <p className="mt-5"><strong>5. Права и задължения на Администратора</strong></p>
        <p className="mt-3">Администраторът има право:</p>
        <p>- да променя едностранно настоящите Условия за ползване, като публикува промените на Уебсайта и в Приложението</p>
        <p>- да прекрати предоставянето на Услугите по всяко време, без да дължи обезщетение на Потребителите</p>
        <p>- да блокира достъпа на Потребители до Услугите, ако те нарушават настоящите Условия за ползване</p>
        <p className="mt-3">Администраторът е длъжен:</p>
        <p>- да предоставя Услугите в съответствие с обявените условия</p>
        <p>- да защитава личните данни на Потребителите съгласно Политиката за поверителност</p>
        <p className="mt-5"><strong>6. Права и задължения на Потребителя</strong></p>
        <p className="mt-3">Потребителят има право:</p>
        <p>- да използва Услугите в съответствие с настоящите Условия за ползване</p>
        <p>- да получи информация за Услугите от Администратора</p>
        <p className="mt-3">Потребителят е длъжен:</p>
        <p>- да предоставя точна и актуална информация за себе си при регистрацията си за Услугите</p>
        <p>- да спазва настоящите Условия за ползване</p>
        <p>- да не използва Услугите за незаконни или вредни цели</p>
        <p className="mt-5"><strong>7. Ограничаване на отговорността</strong></p>
        <p className="mt-3">Администраторът не носи отговорност за:</p>
        <p>- загуба или повреда на данни, причинени от Потребителя</p>
        <p>- загуба или повреда на данни, причинени от форсмажорни обстоятелства</p>
        <p>- загуба или повреда на данни, причинени от действия на трети лица</p>
        <p className="mt-5"><strong>8. Приложимо право и юрисдикция</strong></p>
        <p>Настоящите Условия за ползване се уреждат и тълкуват в съответствие с българското законодателство.</p>
        <p>Всички спорове, възникнали във връзка с настоящите Условия за ползване, се решават от компетентния български съд.</p>
        <p className="mt-5"><strong>9. Заключителни разпоредби</strong></p>
        <p>Ако някоя от разпоредбите на настоящите Условия за ползване е невалидна или неприложима, това няма да повлияе на валидността или приложимостта на останалите разпоредби.</p>
        <p>Администраторът има право да променя настоящите Условия за ползване по всяко време, като публикува промените на Уебсайта и в Приложението.</p>
      </div>
    )
  }


  return (
    <>
      <Dialog header={props.title} visible={props.visible}  style={{ width: '85vw' }} onHide={() => props.setVisible(false)}>
        {contentPolocy}
      </Dialog>
    </>
  );
}